In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r"C:\Users\User\Downloads\SBA-class-activity-main\nba.csv")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 592 entries, 0 to 591
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      591 non-null    object
 1   Team      591 non-null    object
 2   Position  584 non-null    object
 3   Height    585 non-null    object
 4   Weight    584 non-null    float64
 5   College   578 non-null    object
 6   Salary    488 non-null    float64
dtypes: float64(2), object(5)
memory usage: 32.5+ KB

In [4]:
df.isna().value_counts()

Name   Team   Position  Height  Weight  College  Salary
False  False  False     False   False   False    False     475
                                                 True      102
              True      True    True    True     False       6
              False     False   False   True     False       5
                                                 True        1
                                True    False    False       1
              True      False   False   True     False       1
True   True   True      True    True    True     True        1
Name: count, dtype: int64

In [6]:
df.describe(include = 'all')

,Name,Team,Position,Height,Weight,College,Salary
count,591,591,584,585,584.000000,578,4.880000e+02
unique,591,30,7,20,NaN,182,NaN
top,Saddiq Bey,Dallas Mavericks,G,6-5,NaN,Kentucky,NaN
freq,1,23,229,74,NaN,29,NaN
mean,NaN,NaN,NaN,NaN,214.763699,NaN,9.218978e+06
std,NaN,NaN,NaN,NaN,23.460612,NaN,1.131927e+07
min,NaN,NaN,NaN,NaN,160.000000,NaN,5.088910e+05
25%,NaN,NaN,NaN,NaN,198.000000,NaN,1.980599e+06
50%,NaN,NaN,NaN,NaN,215.000000,NaN,4.018638e+06
75%,NaN,NaN,NaN,NaN,230.000000,NaN,1.169694e+07
max,NaN,NaN,NaN,NaN,290.000000,NaN,5.191562e+07

In [7]:
df.shape

(592, 7)

In [14]:
df.dropna(subset = ['College', 'Weight', 'Salary'])

,Name,Team,Position,Height,Weight,College,Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0
...,...,...,...,...,...,...,...
585,Eugene Omoruyi,Washington Wizards,F,6-6,235.0,Oregon,559782.0
586,Jordan Poole,Washington Wizards,G,6-4,194.0,Michigan,27955357.0
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0

In [17]:
mean = df.Salary.mean().round(2)

In [18]:
mean

9218978.29

In [20]:
df['Salary'].fillna(mean, inplace = True)

C:\Users\User\AppData\Local\Temp\ipykernel_26176\743422779.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(mean, inplace = True)

In [24]:
df['College'].fillna('Unknown', inplace = True)

C:\Users\User\AppData\Local\Temp\ipykernel_26176\2679579492.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['College'].fillna('Unknown', inplace = True)

In [25]:
df.loc[df['Position']=='G', ['Name', 'Team', 'Position']]

                  Name                Team Position
1    Bogdan Bogdanovic       Atlanta Hawks        G
2          Kobe Bufkin       Atlanta Hawks        G
5        Trent Forrest       Atlanta Hawks        G
10          Seth Lundy       Atlanta Hawks        G
11    Garrison Mathews       Atlanta Hawks        G
..                 ...                 ...      ...
584      Kendrick Nunn  Washington Wizards        G
586       Jordan Poole  Washington Wizards        G
587       Ryan Rollins  Washington Wizards        G
588      Landry Shamet  Washington Wizards        G
590       Delon Wright  Washington Wizards        G

[229 rows x 3 columns]

In [35]:
df['New Salary'] = df['Salary']*1.05

In [36]:
df

,Name,Team,Position,Height,Weight,College,Salary,New Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4.784832e+06
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00,1.963500e+07
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00,4.298956e+06
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,2.164680e+07
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00,2.710598e+06
...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00,1.805857e+06
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00,1.076250e+07
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9.679927e+06
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8.604878e+06
591,NaN,NaN,NaN,NaN,NaN,Unknown,9218978.29,9.679927e+06

In [39]:
df.drop('New Salary', axis = 1) # To remove a column.

,Name,Team,Position,Height,Weight,College,Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00
...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00
591,NaN,NaN,NaN,NaN,NaN,Unknown,9218978.29

In [40]:
df.iloc[0:10, 3]

0     6-7
1     6-5
2     6-5
3    6-10
4    6-10
5     6-4
6     6-6
7    6-11
8     6-8
9     6-8
Name: Height, dtype: object

In [41]:
df.iloc[0:9, 0:3]

                Name           Team Position
0         Saddiq Bey  Atlanta Hawks        F
1  Bogdan Bogdanovic  Atlanta Hawks        G
2        Kobe Bufkin  Atlanta Hawks        G
3       Clint Capela  Atlanta Hawks        C
4     Bruno Fernando  Atlanta Hawks      F-C
5      Trent Forrest  Atlanta Hawks        G
6         AJ Griffin  Atlanta Hawks        F
7     Mouhamed Gueye  Atlanta Hawks        F
8    De'Andre Hunter  Atlanta Hawks      F-G

In [141]:
df.iloc[:, 0:3]

                  Name                Team Position
0           Saddiq Bey       Atlanta Hawks        F
1    Bogdan Bogdanovic       Atlanta Hawks        G
2          Kobe Bufkin       Atlanta Hawks        G
3         Clint Capela       Atlanta Hawks        C
4       Bruno Fernando       Atlanta Hawks      F-C
..                 ...                 ...      ...
586       Jordan Poole  Washington Wizards        G
587       Ryan Rollins  Washington Wizards        G
588      Landry Shamet  Washington Wizards        G
589   Tristan Vukcevic  Washington Wizards        F
590       Delon Wright  Washington Wizards        G

[583 rows x 3 columns]

In [42]:
df[(df.Salary > 2000000) & (df.Salary <  5000000)]

,Name,Team,Position,Height,Weight,College,Salary,New Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0,2710598.10
6,AJ Griffin,Atlanta Hawks,F,6-6,220.0,Duke,3712920.0,3898566.00
9,Jalen Johnson,Atlanta Hawks,F,6-8,219.0,Duke,2925360.0,3071628.00
...,...,...,...,...,...,...,...,...
567,Brice Sensabaugh,Utah Jazz,F,6-6,235.0,Ohio State,2448600.0,2571030.00
569,Omer Yurtseven,Utah Jazz,C,6-11,275.0,Georgetown,2800000.0,2940000.00
571,Patrick Baldwin,Washington Wizards,F,6-9,220.0,Wisconsin-Milwaukee,2337720.0,2454606.00
581,Corey Kispert,Washington Wizards,F,6-6,224.0,Gonzaga,3722040.0,3908142.00
583,Mike Muscala,Washington Wizards,F-C,6-11,240.0,Bucknell,3500000.0,3675000.00

In [45]:
df.groupby('Team')[['Salary', 'Weight']].mean()

                              Salary      Weight
Team
Atlanta Hawks           8.800612e+06  213.529412
Boston Celtics          1.127678e+07  220.555556
Brooklyn Nets           1.014875e+07  218.647059
Charlotte Hornets       8.300563e+06  206.800000
Chicago Bulls           9.740575e+06  214.368421
Cleveland Cavaliers     1.009781e+07  211.263158
Dallas Mavericks        9.917402e+06  213.454545
Denver Nuggets          7.742399e+06  218.100000
Detroit Pistons         7.132574e+06  215.105263
Golden State Warriors   1.396048e+07  212.470588
Houston Rockets         7.985043e+06  215.700000
Indiana Pacers          7.454708e+06  212.761905
Los Angeles Clippers    1.111828e+07  210.947368
Los Angeles Lakers      1.016767e+07  213.631579
Memphis Grizzlies       8.058016e+06  217.227273
Miami Heat              9.214297e+06  215.714286
Milwaukee Bucks         1.055894e+07  218.045455
Minnesota Timberwolves  1.072232e+07  215.210526
New Orleans Pelicans    1.246189e+07  215.875000
New York Knicks         8.342558e+06  215.523810
Oklahoma City Thunder   6.669030e+06  208.619048
Orlando Magic           8.118387e+06  221.666667
Philadelphia 76ers      1.042463e+07  215.857143
Phoenix Suns            1.120008e+07  224.157895
Portland Trail Blazers  1.093650e+07  211.411765
Sacramento Kings        8.880311e+06  217.333333
San Antonio Spurs       6.502955e+06  210.650000
Toronto Raptors         8.343115e+06  208.952381
Utah Jazz               6.761435e+06  221.400000
Washington Wizards      7.946432e+06  209.666667

In [46]:
fort = pd.read_csv(r"C:\Users\User\Downloads\SBA-class-activity-main\fortune1000.csv")

In [47]:
fort

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,181241,1476,70400
...,...,...,...,...,...,...,...
995,996,New York Community Bancorp,Financials,Commercial Banks,1902,-47,3448
996,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
997,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
998,999,Wendy’s,"Hotels, Resturants & Leisure",Food Services,1896,161,21200
999,1000,Briggs & Stratton,Industrials,Industrial Machinery,1895,46,5480

In [48]:
fort = pd.read_csv(r"C:\Users\User\Downloads\SBA-class-activity-main\fortune1000.csv", index_col = 'Rank')

In [49]:
fort

,Company,Sector,Industry,Revenue,Profits,Employees
Rank,,,,,,
1,Walmart,Retailing,General Merchandisers,482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment",233715,53394,110000
4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),210821,24083,331000
5,McKesson,Health Care,Wholesalers: Health Care,181241,1476,70400
...,...,...,...,...,...,...
996,New York Community Bancorp,Financials,Commercial Banks,1902,-47,3448
997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
999,Wendy’s,"Hotels, Resturants & Leisure",Food Services,1896,161,21200
1000,Briggs & Stratton,Industrials,Industrial Machinery,1895,46,5480

In [51]:
sectors = fort.groupby('Sector')

In [52]:
sectors

In [54]:
sectors.size()

Sector
Aerospace & Defense              20
Apparel                          15
Business Services                51
Chemicals                        30
Energy                          122
Engineering & Construction       26
Financials                      139
Food and Drug Stores             15
Food, Beverages & Tobacco        43
Health Care                      75
Hotels, Resturants & Leisure     25
Household Products               28
Industrials                      46
Materials                        43
Media                            25
Motor Vehicles & Parts           24
Retailing                        80
Technology                      102
Telecommunications               15
Transportation                   36
Wholesalers                      40
dtype: int64

In [61]:
team.size()

Team
Atlanta Hawks             18
Boston Celtics            18
Brooklyn Nets             17
Charlotte Hornets         20
Chicago Bulls             19
Cleveland Cavaliers       19
Dallas Mavericks          23
Denver Nuggets            22
Detroit Pistons           19
Golden State Warriors     17
Houston Rockets           20
Indiana Pacers            21
Los Angeles Clippers      19
Los Angeles Lakers        19
Memphis Grizzlies         22
Miami Heat                22
Milwaukee Bucks           22
Minnesota Timberwolves    19
New Orleans Pelicans      16
New York Knicks           21
Oklahoma City Thunder     21
Orlando Magic             18
Philadelphia 76ers        21
Phoenix Suns              20
Portland Trail Blazers    17
Sacramento Kings          18
San Antonio Spurs         20
Toronto Raptors           21
Utah Jazz                 21
Washington Wizards        21
dtype: int64

In [59]:
team = df.groupby('Team')

In [64]:
sectors.get_group('Energy').sum()['Revenue']

1517809

In [65]:
sectors['Revenue'].sum()['Energy']

1517809

In [67]:
df.sort_values(by = 'Team')

,Name,Team,Position,Height,Weight,College,Salary,New Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4.784832e+06
17,Trae Young,Atlanta Hawks,G,6-1,164.0,Oklahoma,40064220.00,4.206743e+07
16,Onyeka Okongwu,Atlanta Hawks,F-C,6-9,240.0,Southern California,8109063.00,8.514516e+06
15,Miles Norris,Atlanta Hawks,NaN,NaN,NaN,Unknown,559782.00,5.877711e+05
14,Dejounte Murray,Atlanta Hawks,G,6-5,180.0,Washington,18214000.00,1.912470e+07
...,...,...,...,...,...,...,...,...
570,Deni Avdija,Washington Wizards,F,6-9,210.0,Maccabi Tel Aviv,6263188.00,6.576347e+06
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9.679927e+06
579,Anthony Gill,Washington Wizards,F,6-8,230.0,Virginia,1997238.00,2.097100e+06
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8.604878e+06
591,NaN,NaN,NaN,NaN,NaN,Unknown,9218978.29,9.679927e+06

In [70]:
df.sort_index(ascending = False)

,Name,Team,Position,Height,Weight,College,Salary,New Salary
591,NaN,NaN,NaN,NaN,NaN,Unknown,9218978.29,9.679927e+06
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8.604878e+06
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9.679927e+06
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00,1.076250e+07
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00,1.805857e+06
...,...,...,...,...,...,...,...,...
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00,2.710598e+06
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,2.164680e+07
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00,4.298956e+06
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00,1.963500e+07
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4.784832e+06

In [73]:
df['new Salary'] = df['Salary'] + df['Salary']*0.05

In [74]:
df

,Name,Team,Position,Height,Weight,College,Salary,New Salary,new Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4.784832e+06,4.784832e+06
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00,1.963500e+07,1.963500e+07
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00,4.298956e+06,4.298956e+06
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,2.164680e+07,2.164680e+07
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00,2.710598e+06,2.710598e+06
...,...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00,1.805857e+06,1.805857e+06
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00,1.076250e+07,1.076250e+07
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9.679927e+06,9.679927e+06
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8.604878e+06,8.604878e+06
591,NaN,NaN,NaN,NaN,NaN,Unknown,9218978.29,9.679927e+06,9.679927e+06

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 592 entries, 0 to 591
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        591 non-null    object
 1   Team        591 non-null    object
 2   Position    584 non-null    object
 3   Height      585 non-null    object
 4   Weight      584 non-null    float64
 5   College     592 non-null    object
 6   Salary      592 non-null    float64
 7   New Salary  592 non-null    float64
 8   new Salary  592 non-null    float64
dtypes: float64(4), object(5)
memory usage: 41.8+ KB

In [78]:
df['New Salary'] = df['New Salary'].astype(float)

In [79]:
df

,Name,Team,Position,Height,Weight,College,Salary,New Salary,new Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4784832.0,4.784832e+06
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00,19635000.0,1.963500e+07
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00,4298956.0,4.298956e+06
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,21646800.0,2.164680e+07
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00,2710598.0,2.710598e+06
...,...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00,1805857.0,1.805857e+06
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00,10762500.0,1.076250e+07
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9679927.0,9.679927e+06
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8604878.0,8.604878e+06
591,NaN,NaN,NaN,NaN,NaN,Unknown,9218978.29,9679927.0,9.679927e+06

In [80]:
df.drop('new Salary', axis = 1, inplace = True)

In [81]:
df

,Name,Team,Position,Height,Weight,College,Salary,New Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4784832.0
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00,19635000.0
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00,4298956.0
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,21646800.0
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00,2710598.0
...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00,1805857.0
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00,10762500.0
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9679927.0
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8604878.0
591,NaN,NaN,NaN,NaN,NaN,Unknown,9218978.29,9679927.0

In [82]:
df.dropna(axis = 0)

,Name,Team,Position,Height,Weight,College,Salary,New Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4784832.0
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00,19635000.0
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00,4298956.0
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,21646800.0
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00,2710598.0
...,...,...,...,...,...,...,...,...
586,Jordan Poole,Washington Wizards,G,6-4,194.0,Michigan,27955357.00,29353124.0
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00,1805857.0
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00,10762500.0
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9679927.0
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8604878.0

In [83]:
df.dropna(axis = 0, inplace = True)

In [91]:
df[['Feet', 'Inch']] = df['Height'].str.split('-', expand = True)

In [92]:
df

,Name,Team,Position,Height,Weight,College,Salary,New Salary,"(Feet, Inch)",Feet,Inch
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4784832.0,6-7,6,7
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00,19635000.0,6-5,6,5
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00,4298956.0,6-5,6,5
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,21646800.0,6-10,6,10
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00,2710598.0,6-10,6,10
...,...,...,...,...,...,...,...,...,...,...,...
586,Jordan Poole,Washington Wizards,G,6-4,194.0,Michigan,27955357.00,29353124.0,6-4,6,4
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00,1805857.0,6-3,6,3
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00,10762500.0,6-4,6,4
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9679927.0,6-10,6,10
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8604878.0,6-5,6,5

In [98]:
df.drop(('Feet', 'Inch'), axis =1, inplace = True)

In [101]:
df[['Feet', 'Inch']] = df[['Feet', 'Inch']].apply(pd.to_numeric)

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 583 entries, 0 to 590
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        583 non-null    object
 1   Team        583 non-null    object
 2   Position    583 non-null    object
 3   Height      583 non-null    object
 4   Weight      583 non-null    float64
 5   College     583 non-null    object
 6   Salary      583 non-null    float64
 7   New Salary  583 non-null    float64
 8   Feet        583 non-null    int64
 9   Inch        583 non-null    int64
dtypes: float64(3), int64(2), object(5)
memory usage: 50.1+ KB

In [103]:
df.Salary.isna().value_counts()

Salary
False    583
Name: count, dtype: int64

In [105]:
# df['Salary'].dropna(inplace = True)
# df.Salary.isna().value_counts()

In [110]:
df2 = df.loc[0:, ['Name', 'Team', 'Salary']]

In [111]:
df2

                  Name                Team       Salary
0           Saddiq Bey       Atlanta Hawks   4556983.00
1    Bogdan Bogdanovic       Atlanta Hawks  18700000.00
2          Kobe Bufkin       Atlanta Hawks   4094244.00
3         Clint Capela       Atlanta Hawks  20616000.00
4       Bruno Fernando       Atlanta Hawks   2581522.00
..                 ...                 ...          ...
586       Jordan Poole  Washington Wizards  27955357.00
587       Ryan Rollins  Washington Wizards   1719864.00
588      Landry Shamet  Washington Wizards  10250000.00
589   Tristan Vukcevic  Washington Wizards   9218978.29
590       Delon Wright  Washington Wizards   8195122.00

[583 rows x 3 columns]

In [112]:
df2.sort_values(by = 'Team', ascending = True)

                 Name                Team       Salary
0          Saddiq Bey       Atlanta Hawks   4556983.00
17         Trae Young       Atlanta Hawks  40064220.00
16     Onyeka Okongwu       Atlanta Hawks   8109063.00
14    Dejounte Murray       Atlanta Hawks  18214000.00
13        Patty Mills       Atlanta Hawks   6802950.00
..                ...                 ...          ...
571   Patrick Baldwin  Washington Wizards   2337720.00
570       Deni Avdija  Washington Wizards   6263188.00
589  Tristan Vukcevic  Washington Wizards   9218978.29
579      Anthony Gill  Washington Wizards   1997238.00
590      Delon Wright  Washington Wizards   8195122.00

[583 rows x 3 columns]

In [113]:
df2.sort_values(by = 'Salary', ascending = False)

                  Name                   Team      Salary
175      Stephen Curry  Golden State Warriors  51915615.0
461       Kevin Durant           Phoenix Suns  47649433.0
261       LeBron James     Los Angeles Lakers  47607350.0
145       Nikola Jokic         Denver Nuggets  47607350.0
436        Joel Embiid     Philadelphia 76ers  47607350.0
..                 ...                    ...         ...
493         Keon Ellis       Sacramento Kings    559782.0
392      Dylan Windler        New York Knicks    559782.0
140   Collin Gillespie         Denver Nuggets    559782.0
336  Lindell Wigginton        Milwaukee Bucks    559782.0
5        Trent Forrest          Atlanta Hawks    508891.0

[583 rows x 3 columns]

In [130]:
df[(df['Position'] == 'C') & (df['Weight'] > 250)]

,Name,Team,Position,Height,Weight,College,Salary,New Salary,Feet,Inch
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,21646800.0,6,10
45,Day'Ron Sharpe,Brooklyn Nets,C,6-9,265.0,North Carolina,2210040.00,2320542.0,6,9
80,Andre Drummond,Chicago Bulls,C,6-11,279.0,Connecticut,3360000.00,3528000.0,6,11
89,Nikola Vucevic,Chicago Bulls,C,6-10,260.0,Southern California,18518519.00,19444444.0,6,10
145,Nikola Jokic,Denver Nuggets,C,6-11,284.0,Mega Basket,47607350.00,49987717.0,6,11
146,DeAndre Jordan,Denver Nuggets,C,6-11,265.0,Texas A&M,3196448.00,3356270.0,6,11
200,Jock Landale,Houston Rockets,C,6-11,255.0,St. Mary's,8000000.00,8400000.0,6,11
271,Steven Adams,Memphis Grizzlies,C,6-11,265.0,Pittsburgh,12600000.00,13230000.0,6,11
329,Brook Lopez,Milwaukee Bucks,C,7-1,282.0,Stanford,25000000.00,26250000.0,7,1
330,Robin Lopez,Milwaukee Bucks,C,7-0,281.0,Stanford,3196448.00,3356270.0,7,0
344,Rudy Gobert,Minnesota Timberwolves,C,7-1,258.0,Cholet,41000000.00,43050000.0,7,1
369,Jonas Valanciunas,New Orleans Pelicans,C,6-11,265.0,Lietuvos rytas Vilnius,15435000.00,16206750.0,6,11
457,Bismack Biyombo,Phoenix Suns,C,6-8,255.0,Baloncesto Fuenlabrada,9218978.29,9679927.0,6,8
483,Jusuf Nurkic,Portland Trail Blazers,C,7-0,290.0,Cedevita,16875000.00,17718750.0,7,0
569,Omer Yurtseven,Utah Jazz,C,6-11,275.0,Georgetown,2800000.00,2940000.0,6,11

In [119]:
college = pd.Series(df['College'])

In [122]:
college.size

583

In [142]:
len(clg)

183

In [123]:
clg = df.groupby('College')

In [126]:
size = clg.size()

In [128]:
size.sort_values(ascending = False)

College
Kentucky                  29
Duke                      25
UCLA                      15
Arizona                   12
Gonzaga                   12
                          ..
Loyola-Maryland            1
Louisiana Tech             1
Lipscomb                   1
Lietuvos rytas Vilnius     1
Zalgiris                   1
Length: 183, dtype: int64

In [131]:
fd = pd.read_csv(r"C:\Users\User\Downloads\SBA-class-activity-main\fortune1000.csv")

In [133]:
fd.groupby('Sector')['Revenue'].sum()

Sector
Aerospace & Defense              357940
Apparel                           95968
Business Services                272195
Chemicals                        243897
Energy                          1517809
Engineering & Construction       153983
Financials                      2217159
Food and Drug Stores             483769
Food, Beverages & Tobacco        555967
Health Care                     1614707
Hotels, Resturants & Leisure     169546
Household Products               234737
Industrials                      497581
Materials                        259145
Media                            220764
Motor Vehicles & Parts           482540
Retailing                       1465076
Technology                      1377600
Telecommunications               461834
Transportation                   408508
Wholesalers                      444800
Name: Revenue, dtype: int64

In [134]:
fd.groupby('Sector')['Revenue'].sum()['Apparel']

95968

In [135]:
fd

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,181241,1476,70400
...,...,...,...,...,...,...,...
995,996,New York Community Bancorp,Financials,Commercial Banks,1902,-47,3448
996,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
997,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
998,999,Wendy’s,"Hotels, Resturants & Leisure",Food Services,1896,161,21200
999,1000,Briggs & Stratton,Industrials,Industrial Machinery,1895,46,5480

In [138]:
sectors.agg({'Employees': 'sum', 'Profits': 'mean'})

                              Employees      Profits
Sector
Aerospace & Defense              968057  1437.100000
Apparel                          346397   549.066667
Business Services               1361050   553.470588
Chemicals                        463651   754.266667
Energy                          1188927  -602.024590
Engineering & Construction       406708   204.000000
Financials                      3359948  1872.007194
Food and Drug Stores            1395398  1117.266667
Food, Beverages & Tobacco       1211632  1195.744186
Health Care                     2678289  1414.853333
Hotels, Resturants & Leisure    2484245   827.880000
Household Products               646038   515.285714
Industrials                     1545229   451.391304
Materials                        638123   102.976744
Media                            550314   973.880000
Motor Vehicles & Parts          1082560  1079.083333
Retailing                       6227629   597.875000
Technology                      3578949  1769.343137
Telecommunications               832468  3242.466667
Transportation                  1536793  1226.916667
Wholesalers                      525597   205.825000

In [139]:
df.dropna()

,Name,Team,Position,Height,Weight,College,Salary,New Salary,Feet,Inch
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4784832.0,6,7
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00,19635000.0,6,5
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00,4298956.0,6,5
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,21646800.0,6,10
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00,2710598.0,6,10
...,...,...,...,...,...,...,...,...,...,...
586,Jordan Poole,Washington Wizards,G,6-4,194.0,Michigan,27955357.00,29353124.0,6,4
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00,1805857.0,6,3
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00,10762500.0,6,4
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9679927.0,6,10
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8604878.0,6,5

In [140]:
df.dropna(how='all')

,Name,Team,Position,Height,Weight,College,Salary,New Salary,Feet,Inch
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.00,4784832.0,6,7
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.00,19635000.0,6,5
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.00,4298956.0,6,5
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.00,21646800.0,6,10
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.00,2710598.0,6,10
...,...,...,...,...,...,...,...,...,...,...
586,Jordan Poole,Washington Wizards,G,6-4,194.0,Michigan,27955357.00,29353124.0,6,4
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.00,1805857.0,6,3
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.00,10762500.0,6,4
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,9218978.29,9679927.0,6,10
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.00,8604878.0,6,5

In [143]:
fd.groupby('Sector')['Revenue'].sum()['Energy']

1517809

In [144]:
sectors

In [147]:
sectors.get_group('Energy').sum()['Revenue']

1517809

In [ ]:
sectors.get_group